In [1]:
import numpy as np
import pandas as pd

In [2]:
!pip install sklearn

Requirement already satisfied: sklearn in c:\users\sharath r\appdata\local\programs\python\python39\lib\site-packages (0.0)
Requirement already satisfied: scikit-learn in c:\users\sharath r\appdata\local\programs\python\python39\lib\site-packages (from sklearn) (1.5.1)
Requirement already satisfied: threadpoolctl>=3.1.0 in c:\users\sharath r\appdata\local\programs\python\python39\lib\site-packages (from scikit-learn->sklearn) (3.5.0)
Requirement already satisfied: scipy>=1.6.0 in c:\users\sharath r\appdata\local\programs\python\python39\lib\site-packages (from scikit-learn->sklearn) (1.13.1)
Requirement already satisfied: numpy>=1.19.5 in c:\users\sharath r\appdata\local\programs\python\python39\lib\site-packages (from scikit-learn->sklearn) (1.26.4)
Requirement already satisfied: joblib>=1.2.0 in c:\users\sharath r\appdata\local\programs\python\python39\lib\site-packages (from scikit-learn->sklearn) (1.4.2)

WARNING: You are using pip version 21.1.1; however, version 24.3.1 is available.
You should consider upgrading via the 'c:\users\sharath r\appdata\local\programs\python\python39\python.exe -m pip install --upgrade pip' command.

In [3]:
import sklearn

In [4]:
df=pd.read_csv("data.csv")

In [5]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0       Yes
1    Spain  27.0  48000.0       Yes
2      NaN  30.0  54000.0       NaN
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [6]:
from sklearn.impute import SimpleImputer

In [14]:
imputer=SimpleImputer(missing_values=np.nan,strategy='most_frequent')

In [20]:
df.iloc[:,1:9]=imputer.fit_transform(df.iloc[:,1:9].values)

In [21]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0       Yes
1    Spain  27.0  48000.0       Yes
2      NaN  30.0  54000.0       Yes
3    Spain  38.0  61000.0        No
4  Germany  40.0  48000.0       Yes
5   France  35.0  58000.0       Yes
6    Spain  27.0  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [22]:
#Now above you seen the germany row fill the salary value is 48000.0

In [23]:
print(df.isnull().sum())

Country      1
Age          0
Salary       0
Purchased    0
dtype: int64

In [24]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0       Yes
1    Spain  27.0  48000.0       Yes
2      NaN  30.0  54000.0       Yes
3    Spain  38.0  61000.0        No
4  Germany  40.0  48000.0       Yes
5   France  35.0  58000.0       Yes
6    Spain  27.0  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [31]:
imputer=SimpleImputer(missing_values=np.nan,strategy='most_frequent')
df.iloc[:,:]=imputer.fit_transform(df.iloc[:,:].values)

In [32]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0       Yes
1    Spain  27.0  48000.0       Yes
2   France  30.0  54000.0       Yes
3    Spain  38.0  61000.0        No
4  Germany  40.0  48000.0       Yes
5   France  35.0  58000.0       Yes
6    Spain  27.0  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [35]:
imputer=SimpleImputer(missing_values=np.nan,strategy='most_frequent')
imputer.fit_transform(df.values)
df=imputer.transform(df)

C:\Users\sharath R\AppData\Local\Programs\Python\Python312\Lib\site-packages\sklearn\base.py:486: UserWarning: X has feature names, but SimpleImputer was fitted without feature names
  warnings.warn(

In [36]:
df

array([['France', 44.0, 72000.0, 'Yes'],
       ['Spain', 27.0, 48000.0, 'Yes'],
       ['France', 30.0, 54000.0, 'Yes'],
       ['Spain', 38.0, 61000.0, 'No'],
       ['Germany', 40.0, 48000.0, 'Yes'],
       ['France', 35.0, 58000.0, 'Yes'],
       ['Spain', 27.0, 52000.0, 'No'],
       ['France', 48.0, 79000.0, 'Yes'],
       ['Germany', 50.0, 83000.0, 'No'],
       ['France', 37.0, 67000.0, 'Yes']], dtype=object)